src/cf/src/Documents/отусВыдачаИнструментов/отусВыдачаИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>отусВыдачаИнструментов</name>
  <basedOn>Document.отусЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.отусВзаиморасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.отусВыданныеИнструменты</registerRecords>
  <registerRecords>AccumulationRegister.отусОстаткиИнструментов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef._ДемоОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef._ДемоКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.отусЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоМестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef._ДемоНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/отусВзаиморасчетыСКлиентами/отусВзаиморасчетыСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусВзаиморасчетыСКлиентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef._ДемоКонтрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.отусЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef._ДемоОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/отусОстаткиИнструментов/отусОстаткиИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусОстаткиИнструментов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоМестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>CatalogRef._ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/отусВыданныеИнструменты/отусВыданныеИнструменты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>отусВыданныеИнструменты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef._ДемоМестаХранения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.отусЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>CatalogRef._ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/отусВыдачаИнструментов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	// Начало замера производительности по APDEX
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	
	// Контроль оплаты заказа клиента
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	отусВзаиморасчетыСКлиентамиОстатки.ЗаказКлиента КАК ЗаказКлиента,
	|	отусВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.отусВзаиморасчетыСКлиентами.Остатки КАК отусВзаиморасчетыСКлиентамиОстатки
	|ГДЕ
	|	отусВзаиморасчетыСКлиентамиОстатки.ЗаказКлиента = &ЗаказКлиента";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		СуммаЗаказаКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиента, "СуммаДокумента");
		Если Выборка.СуммаОстаток < СуммаЗаказаКлиента Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1 оплачен частично.'"), ЗаказКлиента);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	
	Иначе	
		ТекстСообщения = СтрШаблон(НСтр("ru = '%1 не оплачен.'"), ЗаказКлиента);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	// Контроль остатков инструмента на складе
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	отусВыдачаИнструментовСостав.Инструмент КАК Инструмент,
	|	отусВыдачаИнструментовСостав.Количество КАК Количество
	|ПОМЕСТИТЬ втСостав
	|ИЗ
	|	Документ.отусВыдачаИнструментов.Состав КАК отусВыдачаИнструментовСостав
	|ГДЕ
	|	отусВыдачаИнструментовСостав.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Инструмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	отусОстаткиИнструментовОстатки.Инструмент КАК Инструмент,
	|	отусОстаткиИнструментовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.отусОстаткиИнструментов.Остатки КАК отусОстаткиИнструментовОстатки
	|ГДЕ
	|	отусОстаткиИнструментовОстатки.Склад = &Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Инструмент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСостав.Инструмент КАК Инструмент,
	|	втСостав.Количество - ЕСТЬNULL(втОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	втСостав КАК втСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	|		ПО втСостав.Инструмент = втОстатки.Инструмент
	|ГДЕ
	|	ЕСТЬNULL(втОстатки.КоличествоОстаток, 0) < втСостав.Количество";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не хватает остатка инструмента %1 в количестве %2 ед.'"), Выборка.Инструмент, Выборка.Количество);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
		ЗаписьЖурналаРегистрации("Ошибка",, Метаданные.Документы.отусВыдачаИнструментов, Ссылка, ТекстСообщения);
	КонецЦикла;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	// Движения по регистрам

	// Списание инструмента со склада
	НаборДвиженийОстатки = Движения.отусОстаткиИнструментов;
	НаборДвиженийОстатки.Записывать = Истина; 
	
	НаборДвиженийВыдано = Движения.отусВыданныеИнструменты;
	НаборДвиженийВыдано.Записывать = Истина;
	
	Для каждого ТекущаяСтрока Из Состав Цикл
	    Движение = НаборДвиженийОстатки.ДобавитьРасход();  
		Движение.Период			= Дата;
		Движение.Склад 			= Склад;
		Движение.Инструмент 	= ТекущаяСтрока.Инструмент;
		Движение.Количество     = ТекущаяСтрока.Количество; 
		
		Движение = НаборДвиженийВыдано.ДобавитьПриход();  
		Движение.Период			= Дата;
		Движение.ЗаказКлиента	= ЗаказКлиента;
		Движение.Склад 			= Склад;
		Движение.Инструмент 	= ТекущаяСтрока.Инструмент;
		Движение.Количество     = ТекущаяСтрока.Количество;
	КонецЦикла;
	
	Движения.Записать();
	
	// Начало замера производительности по APDEX
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ВыдачаИнструментовПроведение", ВремяНачала);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.отусЗаказКлиента") Тогда
		
		ЗаказКлиента = ДанныеЗаполнения.Ссылка;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация,Клиент,Склад");
		
		Для каждого ТекущаяСтрока Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Состав.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
